#Задача №3790. Минимум 4 чисел
#https://informatics.msk.ru/mod/statements/view3.php?id=3962&chapterid=3790#1
#
#Напишите функцию min4(a, b, c, d), вычисляющую минимум четырех чисел, которая не содержит инструкции if, а использует стандартную функцию min. Считайте четыре целых числа и выведите их минимум.
#
#Входные данные
#Вводятся четыре целых числа.
#
#Выходные данные
#Выведите ответ на задачу.

def x_min(x1,x2,x3,x4):
	return min(x1,x2,x3,x4)
x1=int(input("Введите число 1: "))
x2=int(input("Введите число 2: "))
x3=int(input("Введите число 3: "))
x4=int(input("Введите число 4: "))
print("Минимально значение из введённых -",x_min(x1,x2,x3,x4), sep=None)
input("Для завершения нажмите любую клавишу...")