#Задача №3791. Длина отрезка
#https://informatics.msk.ru/mod/statements/view3.php?id=3962&chapterid=3791#1
#Даны четыре действительных числа: x1, y1, x2, y2.
#Напишите функцию distance(x1, y1, x2, y2), вычисляющую расстояние между точкой (x1,y1) и (x2,y2).
#Считайте четыре действительных числа и выведите результат работы этой функции.
#
#Входные данные
#Вводятся четыре действительных числа.
#
#Выходные данные
#Выведите ответ на задачу.
#
def distance(x1, y1, x2, y2):
	return ((x1-x2)**2+(y1-y2)**2)**0.5

x1=int(input("Введите координату X 1-ой точки: "))
y1=int(input("Введите координату Y 1-ой точки: "))
x2=int(input("Введите координату X 2-ой точки: "))
y2=int(input("Введите координату Y 2-ой точки: "))

print(distance(x1, y1, x2, y2))

input("Для завершения нажмите любую клавишу...")