#Создать консольную программу-калькулятор с интерактивным меню со следующими функциями:
#Сложение двух чисел
#Вычитание двух чисел
#Умножение двух чисел
#Деление двух чисел
#Возведение первого числа в степень второго числа
#
print("Это программа-калькулятор")
a=float(input("Введите число 1: "))
b=float(input("Введите число 2: "))
c=input("Введите операнд (* / + - ^): ")
if c=="^":
	print("Число", a, "было возведено в степень", b, "результат:" ,a**b, sep=None)
elif c=="*":
	print("Число", a, "было умножено на", b, "результат:" ,a*b, sep=None)
elif c=="/":	
	print("Число", a, "было разделено на", b, "результат:" ,a/b, sep=None)
elif c=="+":
	print("Число", a, "было сложено с", b, "результат:" ,a+b, sep=None)
elif c=="-":
	print("Число", b, "было отнято от", a, "результат:" ,a-b, sep=None)
input("Для завершения нажмите любую клавишу...")